app/controllers/streams_controller.rb

  def index
    @streams = Stream.all
---
SELECT * FROM "streams"

  def broadcast
    @stream = Stream.find(params[:id])
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)

  def paid
    @stream = Stream.find(params[:id])
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)

  def show
    @stream = Stream.find(params[:id])
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)

  def edit
    @stream = Stream.find(params[:id])
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)

  def create
    @stream = Stream.new(params[:stream])

    respond_to do |format|
      if @stream.save
---
INSERT INTO "streams" ("name", "created_at", "paid", "updated_at", "user_id", "description") VALUES('monkeys', '2010-08-15 05:38:18', NULL, '2010-08-15 05:38:18', NULL, 'are good for you')

  def update
    @stream = Stream.find(params[:id])

    respond_to do |format|
      if @stream.update_attributes(params[:stream])
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)
UPDATE "streams" SET "updated_at" = '2010-08-15 02:40:29', "name" = 'Orwell''s Tavern', "description" = 'Big Brother hangs out here to make sure you are thinking good thoughts,' WHERE "id" = 1

  def destroy
    @stream = Stream.find(params[:id])
    @stream.destroy
---
SELECT * FROM "streams" WHERE ("streams"."id" = 1)
DELETE FROM "streams" WHERE "id" = 1