app/controllers/user_controller.rb

  def paid
    current_user.subscribe="yes"

    respond_to do |format|
      if current_user.save
---
UPDATE "users" SET "updated_at" = '2010-08-15 08:23:02', "subscribe" = 'yes' WHERE "id" = 1

  def no
    current_user.subscribe="no"

    respond_to do |format|
      if current_user.save
---
UPDATE "users" SET "updated_at" = '2010-08-15 08:27:44', "subscribe" = 'no' WHERE "id" = 1